Tekla Open API Reference for Tekla Structures 2025
DetailTypeAttribute.Type Property
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailTypeEnum Type { get; }
Public ReadOnly Property Type As DetailTypeEnum
	Get
Property Value
Type: DetailTypeEnum
See Also
Reference
DetailTypeAttribute Class
Tekla.Structures.Plugins Namespace